import game.Scene;

class Lecture4Task1{
	public static void main(String[] args){
		System.out.println("=======================================");
		//test2();
		task();
	}
	private static void test2(){
	}
	private static void task(){
		Scene.create();
		Scene.run();
		Scene.showResult();
	}
}

/* output:
 */
/*
Задание 4. Битвы магов.
Сегодня будем делать игру.

Есть сцена (game.Scene).
На сцену можно добавить до 10 Персонажей (game.Character)
у каждого персонажа есть позиция (от 0 до 9). На которой он стоит.
 На позиции с одинаковым номером может стоять только один персонаж.
В позициях допускаются пропуски, например, на сцене могут быть всего
 два персонажа: на позиции 1 и на позиции 7.

У абстрактного персонажа есть характеристики:



Текущее здоровье: целое число
	Имя
	Если текущее здоровье у монстра стало отрицательным - он удаляется
	 со сцены и на экран выводится текст "<имя персонажа> убит"

Конкретные персонажи бывают двух типов:
Монстры. Могут атаковать любого персонажа, напрямую нанося урон здоровью.
	Количество урона для каждого конкретного монстра одинаковое, но разные
	 экземпляры монстров могут наносить разное количество урона.
	Если монстр атакует любого персонажа, - на экран должен выводится текст
	 "Монстр <имя> атакует <имя, цели> на <количество> единиц урона урона "
	Маги. Могут колдовать заклинания. Заклинания могут делать что угодно
	со сценой и персонажами на ней.
	У каждого мага есть список заклинаний, которые он может использовать,
	 но не больше 3.

Создайте абстрактный класс game.Spell с методом cast - произнесение заклинания
и полем "название заклинания".

Создайте несколько конкретных заклинаний. Например:
Исцеление - добавляет очков здоровья магу, произнесшему заклинания.
Молния - наносит урон любому персонажу.
Цепная молния - наносит урон, всем персонажам на сцене, кроме мага,
 который произносит заклинание.
Стена огня - наносит урон всем персонажам на четных позициях.
Огненное касание - наносит урон персонажу, стоящему на соседней с магом позиции.
Если на соседних позициях персонажей нет - никому урон не наносится.
Изгнание монстров - наносит урон всем монстрам.
Мигрень - наносит урон всем магам.

Если маг произносит любое заклинание то экран обязательно должен выводится
 общий текст для всех заклинаний:
"Маг <имя> читает заклинание <название заклинания>"
дополнительно должен быть выведен текст, зависящий от заклинания.
Например
"Маг <имя> исцелен на <количество добавленных очков здоровья>.
 Теперь у него <текущее количество> здоровья"
"Цепная молния ударяет по <список персонажей>. Каждый получает <количество> урона."

Игра - пошаговая. В каждый ход все персонажи со сцены делают одно действие:
монстр атакует кого-то, а маг читает любое известное ему заклинание.

Порядок, в котором персонажи выполняют действия может быть любым.
Каждый персонаж сам за себя, если на сцене остался только один персонаж -
 то игра завершается и на экран выводится имя и тип (маг, монстр) победившего персонажа.

Создайте сцену со случайным количеством случайных персонажей, запустите игру.

Замечания к заданию:



Задание довольно сложное и, скорее всего, растянется на несколько занятий.
	Обратите внимание, что многие вещи я намеренно не стал детализировать.
	Например, в каких классах располагаются методы, отвечающие за нанесение
	 урона и вывод сообщений на экран, кто управляет сценой и ходами,
	  как происходит генерация начальной сцены, какая книга заклинаний будет
	   у каждого мага, кого атакуют монстры или какое заклинание читает маг и т.п.

	Ваша задача - проанализировать требования и сделать такую структуру классов,
	 которая наиболее гибко будет решать эти требованиях.

	При проектировании структуры классов помните про "правила хорошего программирования":
	- Дублирование кода обычно плохо
	- Код должен быть простым и расширяемым.

	Например, что будет, если в игру добавится новый персонаж с какими-то новыми
	 способностями ( рыцарь, который от всех заклинаний получает только половину
	  урона или разбойник, который имеет некоторый шанс уклониться от атаки монстра)?
*/